{
    "class_name": "Model",
    "config": {
      "name": "model_21",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              32,
              32,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_21"
          },
          "name": "input_21",
          "inbound_nodes": []
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_61",
            "trainable": true,
            "dtype": "float32",
            "filters": 73,
            "kernel_size": [
              4,
              4
            ],
            "strides": [
              2,
              2
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "truncated_normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0,
                "l2": 0.0005000000237487257
              }
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "conv2d_61",
          "inbound_nodes": [
            [
              [
                "input_21",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_36",
            "trainable": true,
            "dtype": "float32",
            "axis": [
              3
            ],
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
          },
          "name": "batch_normalization_36",
          "inbound_nodes": [
            [
              [
                "conv2d_61",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_62",
            "trainable": true,
            "dtype": "float32",
            "filters": 108,
            "kernel_size": [
              4,
              4
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "truncated_normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0,
                "l2": 0.0005000000237487257
              }
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "conv2d_62",
          "inbound_nodes": [
            [
              [
                "batch_normalization_36",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_63",
            "trainable": true,
            "dtype": "float32",
            "filters": 105,
            "kernel_size": [
              5,
              5
            ],
            "strides": [
              3,
              3
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "truncated_normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0,
                "l2": 0.0005000000237487257
              }
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "conv2d_63",
          "inbound_nodes": [
            [
              [
                "conv2d_62",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_21",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          },
          "name": "flatten_21",
          "inbound_nodes": [
            [
              [
                "conv2d_63",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_86",
            "trainable": true,
            "dtype": "float32",
            "units": 1822,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "truncated_normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0,
                "l2": 0.0005000000237487257
              }
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense_86",
          "inbound_nodes": [
            [
              [
                "flatten_21",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_41",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.471227540082,
            "noise_shape": null,
            "seed": null
          },
          "name": "dropout_41",
          "inbound_nodes": [
            [
              [
                "dense_86",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_87",
            "trainable": true,
            "dtype": "float32",
            "units": 634,
            "activation": "relu",
            "use_bias": false,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "truncated_normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0,
                "l2": 0.0005000000237487257
              }
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense_87",
          "inbound_nodes": [
            [
              [
                "dropout_41",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_88",
            "trainable": true,
            "dtype": "float32",
            "units": 1806,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "truncated_normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0,
                "l2": 0.0005000000237487257
              }
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense_88",
          "inbound_nodes": [
            [
              [
                "dense_87",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_89",
            "trainable": true,
            "dtype": "float32",
            "units": 874,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "truncated_normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0,
                "l2": 0.0005000000237487257
              }
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense_89",
          "inbound_nodes": [
            [
              [
                "dense_88",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_90",
            "trainable": true,
            "dtype": "float32",
            "units": 10,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "truncated_normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0,
                "l2": 0.0005000000237487257
              }
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense_90",
          "inbound_nodes": [
            [
              [
                "dense_89",
                0,
                0,
                {}
              ]
            ]
          ]
        }
      ],
      "input_layers": [
        [
          "input_21",
          0,
          0
        ]
      ],
      "output_layers": [
        [
          "dense_90",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4-tf",
    "backend": "tensorflow"
  }